GopalSaraf/Practicals/PSDL/include/proc/pic18lf27k40.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 0F7Dh
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0004h
CRCCON1_PLEN_LENGTH                      equ 0004h
CRCCON1_PLEN_MASK                        equ 000Fh
CRCCON1_DLEN_POSN                        equ 0004h
CRCCON1_DLEN_POSITION                    equ 0004h
CRCCON1_DLEN_SIZE                        equ 0004h
CRCCON1_DLEN_LENGTH                      equ 0004h
CRCCON1_DLEN_MASK                        equ 00F0h
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_DLEN0_POSN                       equ 0004h
CRCCON1_DLEN0_POSITION                   equ 0004h
CRCCON1_DLEN0_SIZE                       equ 0001h
CRCCON1_DLEN0_LENGTH                     equ 0001h
CRCCON1_DLEN0_MASK                       equ 0010h
CRCCON1_DLEN1_POSN                       equ 0005h
CRCCON1_DLEN1_POSITION                   equ 0005h
CRCCON1_DLEN1_SIZE                       equ 0001h
CRCCON1_DLEN1_LENGTH                     equ 0001h
CRCCON1_DLEN1_MASK                       equ 0020h
CRCCON1_DLEN2_POSN                       equ 0006h
CRCCON1_DLEN2_POSITION                   equ 0006h
CRCCON1_DLEN2_SIZE                       equ 0001h
CRCCON1_DLEN2_LENGTH                     equ 0001h
CRCCON1_DLEN2_MASK                       equ 0040h
CRCCON1_DLEN3_POSN                       equ 0007h
CRCCON1_DLEN3_POSITION                   equ 0007h
CRCCON1_DLEN3_SIZE                       equ 0001h
CRCCON1_DLEN3_LENGTH                     equ 0001h
CRCCON1_DLEN3_MASK                       equ 0080h

// Register: NVMADR
#define NVMADR NVMADR
NVMADR                                   equ 0F7Eh

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 0F7Eh
// bitfield definitions
NVMADRL_ADR_POSN                         equ 0000h
NVMADRL_ADR_POSITION                     equ 0000h
NVMADRL_ADR_SIZE                         equ 0008h
NVMADRL_ADR_LENGTH                       equ 0008h
NVMADRL_ADR_MASK                         equ 00FFh
NVMADRL_ADR0_POSN                        equ 0000h
NVMADRL_ADR0_POSITION                    equ 0000h
NVMADRL_ADR0_SIZE                        equ 0001h
NVMADRL_ADR0_LENGTH                      equ 0001h
NVMADRL_ADR0_MASK                        equ 0001h
NVMADRL_ADR1_POSN                        equ 0001h
NVMADRL_ADR1_POSITION                    equ 0001h
NVMADRL_ADR1_SIZE                        equ 0001h
NVMADRL_ADR1_LENGTH                      equ 0001h
NVMADRL_ADR1_MASK                        equ 0002h
NVMADRL_ADR2_POSN                        equ 0002h
NVMADRL_ADR2_POSITION                    equ 0002h
NVMADRL_ADR2_SIZE                        equ 0001h
NVMADRL_ADR2_LENGTH                      equ 0001h
NVMADRL_ADR2_MASK                        equ 0004h
NVMADRL_ADR3_POSN                        equ 0003h
NVMADRL_ADR3_POSITION                    equ 0003h
NVMADRL_ADR3_SIZE                        equ 0001h
NVMADRL_ADR3_LENGTH                      equ 0001h
NVMADRL_ADR3_MASK                        equ 0008h
NVMADRL_ADR4_POSN                        equ 0004h
NVMADRL_ADR4_POSITION                    equ 0004h
NVMADRL_ADR4_SIZE                        equ 0001h
NVMADRL_ADR4_LENGTH                      equ 0001h
NVMADRL_ADR4_MASK                        equ 0010h
NVMADRL_ADR5_POSN                        equ 0005h
NVMADRL_ADR5_POSITION                    equ 0005h
NVMADRL_ADR5_SIZE                        equ 0001h
NVMADRL_ADR5_LENGTH                      equ 0001h
NVMADRL_ADR5_MASK                        equ 0020h
NVMADRL_ADR6_POSN                        equ 0006h
NVMADRL_ADR6_POSITION                    equ 0006h
NVMADRL_ADR6_SIZE                        equ 0001h
NVMADRL_ADR6_LENGTH                      equ 0001h
NVMADRL_ADR6_MASK                        equ 0040h
NVMADRL_ADR7_POSN                        equ 0007h
NVMADRL_ADR7_POSITION                    equ 0007h
NVMADRL_ADR7_SIZE                        equ 0001h
NVMADRL_ADR7_LENGTH                      equ 0001h
NVMADRL_ADR7_MASK                        equ 0080h
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h
NVMADRL_ADRL_POSN                        equ 0000h
NVMADRL_ADRL_POSITION                    equ 0000h
NVMADRL_ADRL_SIZE                        equ 0008h
NVMADRL_ADRL_LENGTH                      equ 0008h
NVMADRL_ADRL_MASK                        equ 00FFh

